content/posts-org/my-toolschain-for-dev.org
#+hugo_base_dir: ../../
# -*- mode: org; coding: utf-8; -*-
* Header Information                                               :noexport:
#+LaTeX_CLASS_OPTIONS: [11pt]
#+LATEX_HEADER: \usepackage{helvetica}
#+LATEX_HEADER: \setlength{\textwidth}{5.1in} % set width of text portion
#+LATEX_HEADER: \usepackage{geometry}
#+TITLE:     My tools chain for development
#+AUTHOR:    Fei Ni
#+EMAIL:     fei.ni@helix.com
#+DATE:      2022-04-09
#+HUGO_CATEGORIES: helix
#+HUGO_tags: helix
#+hugo_auto_set_lastmod: t
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   ^:{}
#+INFOJS_OPT: view:nil toc:nil ltoc:nil mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+HTML_HEAD: <link rel="stylesheet" href="org.css" type="text/css"/>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STARTUP: hidestars

#+STARTUP: overview   (or: showall, content, showeverything)
http://orgmode.org/org.html#Visibility-cycling  info:org#Visibility cycling

#+TODO: TODO(t) NEXT(n) STARTED(s) WAITING(w@/!) SOMEDAY(S!) | DONE(d!/!) CANCELLED(c@/!)
http://orgmode.org/org.html#Per_002dfile-keywords  info:org#Per-file keywords

#+TAGS: important(i) private(p)
#+TAGS: @HOME(h) @OFFICE(o)
http://orgmode.org/org.html#Setting-tags  info:org#Setting tags

#+NOstartup: beamer
#+NOLaTeX_CLASS: beamer
#+NOLaTeX_CLASS_OPTIONS: [bigger]
#+NOBEAMER_FRAME_LEVEL: 2


# Start from here


* My daily work
  - Coding
  - Docs/Notes
  - Build enviroment (Docker)
  - Communication tool(Slack + Chrome/Gmail)

* Iterm2 + Tmux for terminal work

** Iterm2
   
 - nice default profile with color/fonts
 - Iterm2 can split windows horizontally or vertically with shortcut keys
 - select as copy
 - [[https://gist.github.com/tanyuan/a1a3c00b9c231c32c3613d4bbefa6652][Iterm 2 tips and tricks]]
 - [[https://betterprogramming.pub/5-useful-iterm2-features-for-developers-bc211d697817][5-useful-iterm2-features-for-developers]]
   
** Tmux
 - Session handling: detaching from and attaching to sessions helps me with context switching and remote working
 
* Emacs for all kinds of development work  

** Git plugin

** As a notes tool
   - C-c c, take notes at any time
   - 

** Coding
 - LSP (language server protocal)
   - auto completion
   - jump to definition and jump back
   - flycheck
 - Search keyword and jump to there
 - bookmark for those hotspots
 -  
