content/posts/my-toolschain-for-dev.md
+++
title = "My tools chain for development"
author = ["Fei Ni"]
date = 2022-04-09
lastmod = 2022-04-09T11:51:34-07:00
tags = ["helix"]
categories = ["helix"]
draft = false
+++

## <span class="section-num">1</span> My daily work {#my-daily-work}

-   Coding
-   Docs/Notes
-   Build enviroment (Docker)
-   Communication tool(Slack + Chrome/Gmail)


## <span class="section-num">2</span> Iterm2 + Tmux for terminal work {#iterm2-plus-tmux-for-terminal-work}


### <span class="section-num">2.1</span> Iterm2 {#iterm2}

-   nice default profile with color/fonts
-   Iterm2 can split windows horizontally or vertically with shortcut keys
-   select as copy
-   [Iterm 2 tips and tricks](https://gist.github.com/tanyuan/a1a3c00b9c231c32c3613d4bbefa6652)
-   [5-useful-iterm2-features-for-developers](https://betterprogramming.pub/5-useful-iterm2-features-for-developers-bc211d697817)


### <span class="section-num">2.2</span> Tmux {#tmux}

-   Session handling: detaching from and attaching to sessions helps me with context switching and remote working


## <span class="section-num">3</span> Emacs for all kinds of development work {#emacs-for-all-kinds-of-development-work}


### <span class="section-num">3.1</span> Git plugin {#git-plugin}


### <span class="section-num">3.2</span> As a notes tool {#as-a-notes-tool}

-   C-c c, take notes at any time
-


### <span class="section-num">3.3</span> Coding {#coding}

-   LSP (language server protocal)
    -   auto completion
    -   jump to definition and jump back
    -   flycheck
-   Search keyword and jump to there
-   bookmark for those hotspots
-
